# -*- coding: UTF-8 -*- 
# @author  ：vampire
# @Time    : 2020/7/13 17:31
#
#包 命名
#全部使用小写，中间可以由点分隔开，不推荐使用下划线分割。
# 作为命名空间，包名应该具有唯一性，推荐采用公司或者组织域名的倒置，如com.apple.quicktime.v2

#==============================================================================

#模块命名
# 模块尽量使用小写命名，首字母保持小写，尽量不要用下划线（除非多个单词，且数量不多的情况）
# 正确的模块名
import json
# from Test import read_file
print (json.dumps({'name':'Jack'}))   #将字典转换为字符串
print (type(json.dumps({'name':'Jack'})))  #打印结果为  <class 'str'>
#==============================================================================

#类名 命名
# 类名使用驼峰命名风格，首字母大写，每个单词的首字母大写，私有类可用一个下划线开头
# 正确的类命名
class GetToken():
    pass
class _PrivateFarm():
    pass

#==============================================================================

# 函数命名
# 函数名一律小写，多个单词用下划线分隔开。
def read():
    pass

def read_data_from_config():
    pass

# 私有函数，命名时在前面加一个下划线
def _private():
    pass

#==============================================================================
#变量名  命名
# 变量名尽量用小写，如果有多个单词， 使用下划线分割
def get_info(name, age):
    name = 'Jack'
    age = 20
    print (f'My name is {name},I am {age} years old.')

#==============================================================================
#常量 命名
# 常用全部使用大写字母，如果有多个单词，使用下划线分割
MAX_OVERFLOW = 100







